spec/fixtures/cassettes/charges_get_pay_mTOngouLTJWZ0w.yml

---
http_interactions:
- request:
    method: get
    uri: https://sandbox.espago.com/api/charges/pay_mTOngouLTJWZ0w
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/vnd.espago.v2+json
      Authorization:
      - Basic YXBwX2lkX3Rlc3Q6YXBwX3Bhc3N3b3JkX3Rlc3Q=
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json; charset=utf-8
      X-Meta-Request-Version:
      - 0.2.2
      X-Ua-Compatible:
      - IE=Edge
      Etag:
      - '"76f2464efbd4d4b572cfb2082aefaa65"'
      Cache-Control:
      - max-age=0, private, must-revalidate
      Set-Cookie:
      - _session_id=a96c21ecae477d2b6beccc4c244b4962; path=/; HttpOnly
      X-Request-Id:
      - 439cf8ff9ff17680379731a0cf7a7a92
      X-Runtime:
      - '1.759306'
      Connection:
      - close
      Server:
      - thin 1.5.0 codename Knife
    body:
      encoding: UTF-8
      string: '{"id":"pay_mTOngouLTJWZ0w","description":"Test12345","channel":"elavon","amount":"49.99","currency":"PLN","state":"executed","client":"cli_YM5tKz6-IfhN7T","created_at":1416917311,"issuer_response_code":"00","reversable":true,"transaction_id":"tn_5puLXUWDf"}'
    http_version:
  recorded_at: Tue, 25 Nov 2014 12:39:26 GMT
recorded_with: VCR 2.9.3
